"use strick";



  2.მოცემულია სტრინგი: let info= ‘good day”,
 ამოიღეთ სიტყვა day და ჩასვით ახალ ცვლადში slice მეთო დის საშუალებით.

 let info=[ 'good','day'];
 let NewInfo = info.slice (0,1); 
 console.log(NewInfo);




5.მოცემულია მასივი, რომელშიც არის ერთზე მეტი მნიშვნელობა, 
მაგრამ კონკრეტულად რამდენი არ ვიცით, შეიძლება 100 ან 200 ან 10. მაგ: 
let fruits = [“apple”, “mango”, “avocado”,”kiwi”]  splice
 მეთოდის საშუალებით წაშალეთ ბოლოს წინა მნიშვნელობა და მაგის 
 მაგივრად ჩასვით “strawberry”. 

 let fruits = ['apple', 'mango', 'avocado','kiwi'];
 fruits.splice (fruits.length -1, 1, 'strawberry');
 console.log(fruits);
 

6.შექმენით მასივი, რომლის საწყისი მნიშვნელობა იქნება რიცხვები: 5, 25, 89, 120, 36;

მასივის ბოლოში დაამატეთ ორი ელემენტი(სტრინგი): javascript და python;
მასივის დასაწყისში კი დაამატეთ ელემენტი(სტრინგი): html და css;
გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;

let array6 = [5, 25, 89, 120, 36];
array6.push ('javascript', 'python' );
array6.unshift ('html', 'css' );
array6.shift ();
array6.pop ();
let arraybox 
console.log(array6)

7.შექმენით მასივი, შემდეგი ელემენტებით:ფორთოხალი,ბანანი,კივი;

გამოიტანეთ ინფორმაცია ეკრანზე თუ რამდენი ელემენტი გაქვთ მასივში;
მასივის ბოლოს დაამატეთ ორი ელემენტი: ვაშლი და ანანასი;
მასივის დასაწყისში კი დაამატეთ ელემენტი: საზამთრო; 
გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
მასივის მე-3 ადგილას დაამატეთ ელემენტი: მანგო;
წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
გამოიტანეთ ეკრანზე, თუ რამდენი ელემენტი დარჩა მასივში;

let fruits1 = ['orange','bananas','kiwi'];
console.log(fruits1.length);
fruits1.push ('apple','pineapple');
fruits1.unshift ('watermelon');
console.log(fruits1.length);
fruits1.splice (3,0, 'mango');
fruits1.shift ();
fruits1.pop ();
console.log(fruits1.length);





8.მოცემულია მასივი let array3 =[1, 2, 3, 4, 5]. 
splice მეთოდის საშუალებით მიიღეთ: [1, 2, 3, 'a', 'b', 'c', 4, 5]
let array3 =[1, 2, 3, 4, 5];
array3.splice (3,0, 'a', 'b', 'c' );
console.log(array3);


მოცემულია მასივი:
let  array5 = [12, 25, 3, 6, 8, 14, 7, 23];
map-ის გამოყენებით შექმენით ახალი მასივი, რომელშიც array
 მასივიდან თითოეული ელემენტი იქნება 3-ზე გაყოფილი;

 
let  array5 = [12, 25, 3, 6, 8, 14, 7, 23];
let NewArray = array5.map (function(elements) {
return elements / 3;})
console.log(NewArray);



10.ოცემულია მასივი:წაშალეთ ამ მასივიდან რიცხვი 10;

let array7 =  [15, 100, 25, 10, 36];
array7.splice (3,1);
console.log(array7);

11.მოცემულია მასივი:  let array8 = [1, 2, 3 , 4 , 5]
მეთოდის საშალებით 3-ის მაგივრად ჩასვით სიტყვა three;

let array8 = [1, 2, 3 , 4 , 5];
array8.splice (2,1, 'three' );
console.log(array8);





13.let array4 = [1, 2, 3, 4, 5];
foreach საშუალებით გამოთვალეთ რიცხვების ჯამი

let array4 = [1, 2, 3, 4, 5];
let item=0;
array4.forEach(function(number)
{item +=number;
})
console.log(item);




14.მოცემულია მასივი:
ფილტრის საშულებით გაფილტრეთ და გამოიტანეთ მარტო ის სიტყვა 
რომლის სიმბოლოების რაოდენობა იქნება 3-ზე მეტი;


let languages = ['html', 'css', 'javascript', 'python', 'php'];

languages.forEach(function(item){
if(item.length > 3)
 console.log(item);

})

// 15.მოცემულია მასივი:
// let words = ['Madrid', 'rome', 'Milan', 'berlin'];
// filter მეთოდის საშუალებით დააბრუნეთ მასივი,
//  რომელიც შედგება ისეთი სიტყვებისგან რომელიც შეიცავს ასო m-ს ან M-ს;



//  1.მოცემულია მასიცი:let array2 = [14, 150, 'css', null, 'javascript', 25];

//  შექმენით ახალი მასივი map ფუნქციის საშუალებით შემდეგი ლოგიკით:
//   თუ ელემენტი არის რიცხვი, ამ მასივში უნდა იყოს ამ რიცხვის კვადრატი. 
//   თუ ელემენტი არის სტირნგი, მაშინ ახალ მასივში უნდა იყოს ეს ტექსტი დიდი ასოებით.
//    სხვა შემთხვევაში ელემენტი უნდა დაემატოს უცვლელად.
 


//    3.დაწერეთ ფუნქცია, რომელიც პარამეტრად იღებს სტრინგს,
//    და დააბრუნებს ჩაწერილი სტრინგის სიგრძეს.
  
//    4.prompt ფუნქციის საშუალებით კითხეთ მომხმარებელს შემდეგი კითხვა:
//     საქართველოს დედაქალაქი? სწორი პასუხი ჩაწერეთ პატარა ასობიეთ და 
//      შეინახეთ ცვლადში. როდესაც მიიღებთ პასუხს მომხმარებლისგან,
//       გადაიყვანეთ ეს პასუხი პატარა ასოებად და შეადარეთ სწორ პასუხს.
//    თუ მომხმარებლის პასუხი სწორია, დაბეჭდეთ სწორია, 
//   თუ არა მაშინ დაბეჭდეთ არასწორია.


 

//   12.მოცემულია მასივი, შემდეგი მნიშვნელობებით -
//   გამოიტანეთ მარტო ციფრები მეთოდის საშუალებით;
  
//   let array9 =[“hello1”, 14,24, “hello2”] 








